/*
   Есть три курорта: taba, sharm или hurgada.
   
   Необходимо через prompt попросить ввести число, от 1 до 3-х.
   
   В тексте prompt необходимо написать какое число соотвествует
   какому курорту, на ваш выбор.
   
   После этого вывести сообщение о том, что пользователь 
   выбрал такой-то курорт или сообщение о том, что введено
   число, варианта курорта для которого не было.
*/
let res;

let num = prompt('Введите число от 1 до 3-х', 1);

switch (num) {
  case '1' : res = "taba"; break;
  case '2' : res = "sharm"; break;
  case '3' : res = "hurgada"; break; 
  default  : res = "Введите верное число!";
}

if (num === "1") {
  console.log(`Пользователь выбрал курорт - ${res}!`);
} else if (num === "2") {
  console.log(`Пользователь выбрал курорт - ${res}!`);
} else if (num === "3") {
  console.log(`Пользователь выбрал курорт - ${res}!`);
} else {
  console.log(`Для указанного числа варианта курорта нет!`);
}

